src/cf/src/Enums/Месяца/Месяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Месяца</name>
  <enumValues>
    <name>Январь</name>
  </enumValues>
  <enumValues>
    <name>Февраль</name>
  </enumValues>
  <enumValues>
    <name>Март</name>
  </enumValues>
  <enumValues>
    <name>Апрель</name>
  </enumValues>
  <enumValues>
    <name>Май</name>
  </enumValues>
  <enumValues>
    <name>Июнь</name>
  </enumValues>
  <enumValues>
    <name>Июль</name>
  </enumValues>
  <enumValues>
    <name>Август</name>
  </enumValues>
  <enumValues>
    <name>Сентябрь</name>
  </enumValues>
  <enumValues>
    <name>Октябрь</name>
  </enumValues>
  <enumValues>
    <name>Ноябрь</name>
  </enumValues>
  <enumValues>
    <name>Декабрь</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/Месяца/ManagerModule.bsl
Функция ПолучитьНомерМесяцаПоНаименованию(НаименованиеМесяца) Экспорт
	Если НаименованиеМесяца = Перечисления.Месяца.Январь Тогда
		Возврат 1;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Февраль Тогда
		Возврат 2;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Март Тогда
		Возврат 3;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Апрель Тогда
		Возврат 4;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Май Тогда
		Возврат 5;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Июнь Тогда
		Возврат 6;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Июль Тогда
		Возврат 7;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Август Тогда
		Возврат 8;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Сентябрь Тогда
		Возврат 9;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Октябрь Тогда
		Возврат 10;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Ноябрь Тогда
		Возврат 11;
	ИначеЕсли НаименованиеМесяца = Перечисления.Месяца.Декабрь Тогда
		Возврат 12;	
	КонецЕсли;	
КонецФункции

Функция ПолучитьМесяцПоНомеру(НомерМесяца) Экспорт
	Если НомерМесяца = 1 Тогда
		Возврат Перечисления.Месяца.Январь;
	ИначеЕсли НомерМесяца = 2 Тогда
		Возврат Перечисления.Месяца.Февраль;
	ИначеЕсли НомерМесяца = 3 Тогда
		Возврат Перечисления.Месяца.Март;
	ИначеЕсли НомерМесяца = 4 Тогда
		Возврат Перечисления.Месяца.Апрель;
	ИначеЕсли НомерМесяца = 5 Тогда
		Возврат Перечисления.Месяца.Май;
	ИначеЕсли НомерМесяца = 6 Тогда
		Возврат Перечисления.Месяца.Июнь;
	ИначеЕсли НомерМесяца = 7 Тогда
		Возврат Перечисления.Месяца.Июль;
	ИначеЕсли НомерМесяца = 8 Тогда
		Возврат Перечисления.Месяца.Август;
	ИначеЕсли НомерМесяца = 9 Тогда
		Возврат Перечисления.Месяца.Сентябрь;
	ИначеЕсли НомерМесяца = 10 Тогда
		Возврат Перечисления.Месяца.Октябрь;
	ИначеЕсли НомерМесяца = 11 Тогда
		Возврат Перечисления.Месяца.Ноябрь;
	ИначеЕсли НомерМесяца = 12 Тогда
		Возврат Перечисления.Месяца.Декабрь;	
	КонецЕсли;	
КонецФункции
